[LANG]
language=Hungarian (Magyar nyelv)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=SQL szintaxis hiba
200002=A fájl nem létezik
200003=A fájl sérült
200004=Paraméter hiba
200026=A táblanév már létezik
200027=A táblanév nem létezik
200028=Hiba a CSV fájl importálásakor, nem sikerült SQL-t generálni, ellenőrizze a CSV fájl tartalmát és a konfigurációt
300001=Nincs kijelölve táblaoszlop az index létrehozásához
300002=Az SQL utasítás nem lehet üres
300003=Az SQL elemzés csak SELECT lekérdezéseket támogat
[STRING]
home=Kezdőlap
database=Adatbázis
analysis=Elemzés
view=Nézet
setting=Beállítások
items=rekord
tables=Táblák
views=Nézetek
triggers=Eseménykezelők
columns=Oszlopok
indexes=Indexek
table=Tábla
clear-all=Minden törlése
yes=Igen
no=Nem
welcome-text=Üdvözli a CuteSqlite
home-text1=A CuteSqlite egy grafikus kliens (GUI) eszköz az Sqlite3-hoz.
home-text2=Lehetővé teszi adatbázisok tervezését, létrehozását és böngészését, adatbázis objektumok kezelését,
home-text3=adatok beszúrását, valamint SQL lekérdezések tervezését és futtatását a tárolt adatok feldolgozásához.
home-text4=Az adatbázist és adatokat más adatbázis-szállítóktól is áttelepítheti Sqlite adatbázisba.
db-section-text=Sqlite adatbázis
analysis-text1=A CuteSqlite lehetővé teszi az SQL utasítások teljesítményének elemzését és optimalizálását.
analysis-text2=És lehetővé teszi az adatbázisban lévő egyes táblák tárolókapacitásának elemzését,
analysis-text3=valamint az adatbázis paramétereinek konfigurálását az optimalizáláshoz.
perf-analysis-section-text=Teljesítményelemzés
error-text=Rendszerhiba:
create-database=Új adatbázis létrehozása (Ctrl+N)
open-database=Adatbázis megnyitása (Ctrl+O)
refresh-database=Adatbázis frissítése (F5)
delete-database=A kijelölt adatbázis eltávolítása a listából (Del)
override-user-db=A törölt fájl adatai nem állíthatók vissza. Megerősíti az adatbázis felülírását?
create-db-success-text=Az adatbázis sikeresen létrejött
open-db-exists-inlist=Az adatbázis már nyitva van, ne ismételje meg a műveletet
open-db-success-text=Az adatbázis sikeresen megnyílt
delete-user-db=Megerősíti a(z) "{dbName}" adatbázis eltávolítását a listából?
delete-db-success-text=Az adatbázis sikeresen eltávolításra került a listából
query-editor=Lekérdezés-szerkesztő
history=Előzmények
history-tip=Előzmények (F8)
result-list=Eredmények
result-info=Információ
result-table-data=Tábla adatok
table-properties=Tábla tulajdonságai
exec-select-sql=A kijelölt lekérdezés végrehajtása (F9)
exec-all-sql=Minden lekérdezés végrehajtása (F10)
explain-select-sql=A kijelölt SQL utasítás Explain (F11)
explain-query-plan-sql=A kijelölt SQL utasítás Explain query plan (F12)
query-page-help=Automatikus kiegészítés funkció: [Tab] -> következő lap; [Ctrl+Szóköz] -> egyezések listázása; [Ctrl+Enter] -> összes címke listázása
no-select-userdb=Nincs adatbázis kijelölve
no-sql-statement=A lekérdezés-szerkesztő nem tartalmaz SQL utasítást
no-sql-content=A lekérdezés-szerkesztő nem tartalmaz SQL tartalmat
show-form-view=Űrlap nézet megjelenítése
export-result-as=Exportálás másként... (Ctrl+Alt+E)
copy-result-data=Adatok másolása a vágólapra
clear-all=Minden törlése
ok=OK
cancel=Mégse
export-text-description=Válassza ki az adatexportálás formátumát
csv-settings=CSV opciók
csv-field-settings=Oszlopok
csv-line-settings=Sorok
csv-charset-settings=Karakterkészlet
excel-settings=Excel opciók
sql-settings=SQL opciók
export-fields-settings=Válassza ki az exportálandó oszlopokat
terminated-by=Elválasztó
enclosed-by=Közrezáró jel
escaped-by=Escapelt karakter
field-terminated-by=Oszlopelválasztó
field-enclosed-by=Oszlop közrezáró jel
field-escaped-by=Oszlop escapelt karakter
line-terminated-by=Sorelválasztó
add-column-name=Oszlopnevek hozzáadása a fejléchez
csv-charset=Karakterkészlet
excel-column-max-size=Szöveges oszlop méretkorlátja
excel-decinmal-places=Tizedesjegyek
structure-only=Csak struktúra
data-only=Csak adat
structure-and-data=Struktúra és adat
select-all=Mindet kiválaszt
deselect-all=Kijelölés megszüntetése
save-to-file=Mentés fájlba
expert-fmt-error=Kérem, válassza ki az adatexportálás fájlformátumát
terminated-by-error=Kérem, adja meg az "Elválasztó" értékét
enclosed-by-error=Kérem, adja meg a "Közrezáró jel" értékét
escaped-by-error=Kérem, adja meg az "Escapelt karakter" értékét
line-terminated-by-error=A "Sorelválasztó" értéke helytelen
excel-column-max-size-error=Kérem, adja meg a "Szöveges oszlop méretkorlátja" értékét
excel-decinmal-places-error=Kérem, adja meg a "Tizedesjegyek" értékét
export-sql-error=Kérem, válassza ki az SQL opciókat
selected-fields-error=Kérem, válassza ki az exportálandó oszlopokat
export-path-error=Kérem, adja meg az exportfájl elérési útját
sql-notsupport-multitable-query-error=Többtáblás lekérdezések és allekérdezések eredményeinek exportálása nem támogatott
export-success-text=Exportálás sikeres, {rows} sor adat került exportálásra. Megnyitja a fájlt?
open-the-file=Fájl megnyitása
export-file-exists-prompt={export-path} már létezik. Lecserélje?
limit-rows=Sorok korlátozása
offset=Kezdő sor
rows=Sorok száma
copy-all-rows-to-clipboard=Összes sor másolása vágólapra	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Kijelölt sorok másolása vágólapra	Ctrl+Alt+H
copy-all-rows-as-sql=Összes sor másolása SQL-ként	Ctrl+Alt+J
copy-sel-rows-as-sql=Kijelölt sorok másolása SQL-ként	Ctrl+Alt+K
read-only=Csak olvasható
filter=Szűrő (Ctrl+Alt+F)
filter-in-use=Szűrő használatban
refresh=Frissítés (Ctrl+F5)
refresh-page=Frissítés
new-row-tip=Új sor (Ctrl+Alt+N)
copy-row-tip=Sor másolása (Ctrl+Alt+C)
save-tip=Mentés (Ctrl+Alt+S)
delete-tip=Kijelölt sor törlése (Ctrl+Del)
cancel-tip=Módosítások visszavonása (Ctrl+Alt+Z)
revert-tip=Visszaállítás
save=Mentés
revert=Módosítások visszavonása
column=Oszlop neve
condition=Feltétel
value=Érték
delete-confirm-text=Megerősíti a kijelölt sorok törlését?
query=Lekérdezés
result=Eredmény
affected-rows=Érintett sorok
exec-time=Végrehajtási idő
transfer-time=Átviteli idő
total-time=Teljes idő
database-create=Adatbázis létrehozása		Ctrl+N
database-open=Adatbázis megnyitása		Ctrl+O
database-refresh=Adatbázis frissítése		Ctrl+R
database-delete=Adatbázis törlése		Del
database-copy=Adatbázis másolása mint...	Ctrl+P
database-export-as-sql=Adatbázis exportálása SQL-be	Ctrl+E
database-import-from-sql=SQL importálása adatbázisba	Ctrl+I
database-new=Létrehozás
database-new-table=Tábla
database-new-view=Nézet
database-new-trigger=Eseménykezelő
export-as-sql-text-description=A kijelölt adatbázis tábláinak/nézeteinek/eseménykezelőinek exportálása SQL-ként
select-database=Kijelölt adatbázis
database-objects=Objektumok
structure-and-data-settings=Struktúra és adat beállítások
insert-statement-settings=INSERT utasítás beállításai
tbl-statement-settings=Táblautasítás beállításai
retain-column-text=Oszlopnevek megtartása az "Insert Into"-ban
contain-multi-rows-text=Minden "Insert" utasítás több sort tartalmaz (VALUES)
retain-table-text=Régi tábla megtartása (Create Table If Not Exists ...)
override-table-text=Régi tábla felülírása (DROP TABLE, majd CREATE TABLE)
import-from-sql-text-description=Az SQL fájlban lévő utasítások kötegelt végrehajtása.
abort-on-error-text=Leállítás hiba esetén.
import-file-not-exists=A importálandó SQL fájl nem létezik, válasszon másikat.
import-path-empty-error=Az importfájl elérési útja nem lehet üres.
import=Importálás
export=Exportálás
tbl-name=Tábla neve
new-table=Tábla létrehozása
new-view=Nézet létrehozása
new-trigger=Eseménykezelő létrehozása
database=Adatbázis
schema=Schema
table-columns=Oszlopok
table-indexes=Indexek
table-foreignkeys=Külső kulcsok
column-name=Oszlop neve
data-type=Adattípus
default=Alapértelmezett
check=Ellenőrzés
index-name=Index neve
index-type=Index típusa
index-unique=Unique
partial-clause=Részleges záradék
comments=Megjegyzések
to-be-selected=Elérhető oszlopok
selected=Kijelölve
up=▲
down=▼
no-columns-selected=Nincs oszlop kijelölve, kérem válasszon
sql-preview=SQL előnézet
tbl-name-empty=A tábla neve nem lehet üres
tbl-name-duplicated=A tábla neve már létezik
create-table-success-text=A tábla sikeresen létrejött.
alter-table-success-text=A tábla sikeresen módosult.
rename-table-success-text=A tábla neve sikeresen megváltozott.
delete-column-confirm-text=A kijelölt oszlopra egy vagy több index hivatkozik. Az oszlop törlése módosítani fogja a megfelelő indexeket is. Megerősíti a törlést?
delete-index-confirm-text=A kijelölt indexre egy vagy több oszlop hivatkozik. Az index törlése módosítani fogja a megfelelő oszlopokat is. Megerősíti a törlést?
delete-confirm-text=Megerősíti a törlést?
new-view=Nézet létrehozása
new-trigger=Eseménykezelő létrehozása
create-a-view-name=Új nézet neve
view-name-not-empty=Az új nézet neve nem lehet üres
view-name-duplicated=A nézet neve már létezik
create-a-trigger-name=Eseménykezelő neve
trigger-name-not-empty=Az eseménykezelő neve nem lehet üres
trigger-name-duplicated=Az eseménykezelő neve már létezik
execute-sql-success=Az SQL sikeresen végrehajtódott
copy-db-success-text=Az adatbázis sikeresen másolva
table-open=Tábla adatainak megnyitása		Alt+O
table-create=Tábla létrehozása		Alt+N
table-alter=Tábla módosítása		Alt+A
table-rename=Tábla átnevezése		Alt+M
table-truncate=Tábla kiürítése		Alt+T
table-drop=Tábla törlése		Alt+Del
table-copy-as=Tábla másolása ide...		Alt+P
table-sharding-as=Adatszétválasztás		Alt+G
table-export=Tábla exportálása ide...	Alt+E
table-import-sql=Importálás SQL fájlból	Alt+I
table-import-csv=Importálás CSV fájlból	Alt+J
table-manage-index=Tábla indexek kezelése
table-manage-foreign-key=Tábla külső kulcsok kezelése
properties=Tulajdonságok
primary-key-duplicated=Az elsődleges kulcs többször van definiálva.
foreignkey-name=Külső kulcs neve
referencing-columns=E tábla oszlopai
referenced-table=Hivatkozott tábla
referenced-columns=Hivatkozott oszlopok
on-update=Frissítéskor
on-delete=Törléskor
insert-new-column=Új oszlop hozzáadása
insert-new-index=Új index hozzáadása
insert-new-foreignkey=Új külső kulcs hozzáadása
insert-del-column=Kijelölt oszlop törlése
insert-del-index=Kijelölt index törlése
insert-del-foreignkey=Kijelölt külső kulcs törlése
select-referenced-table-first=Kérem, előbb válassza ki a hivatkozott táblát
new-table-name=Új tábla neve
table-name-not-empty=Az új tábla neve nem lehet üres
table-name-duplicated=Az új tábla neve már létezik
ai-column-exists=Már létezik AUTOINCREMENT oszlop.
ai-fobidden-multi-pk=Már létezik AUTOINCREMENT oszlop, több elsődleges kulcs oszlop nem engedélyezett.
ai-column-must-integer=Az AUTOINCREMENT oszlopnak INTEGER típusúnak kell lennie.
truncate-table-confirm-text=A tábla kiürítése után az adatok nem állíthatók vissza. Megerősíti a kiürítést?
truncate-table-success-text=A tábla adatai sikeresen kiürítve
drop-table-confirm-text=A tábla törlése után az adatok nem állíthatók vissza. Megerősíti a törlést?
drop-table-success-text=A tábla sikeresen törölve
copy-table-text-description=Másolási paraméterek konfigurálása, támogatja az adattábla szétválasztást (sharding)
from-db-name=Forrás adatbázis
from-tbl-name=Forrás tábla
to-db-name=Cél adatbázis
to-tbl-name=Cél tábla
table-sharding-setttings=Adattábla szétválasztása
enable-table-sharding=Adattábla szétválasztás engedélyezése
table-suffix-begin={suffix} Kezdő egész szám
table-suffix-end={suffix} Végző egész szám
advanced-settings=Tábla szétválasztás haladó beállításai
enable-copy-data-with-strategy=Stratégia engedélyezése adatok szétválasztott táblákba másolásához
sharding-strategy-express-text=Szétválasztási stratégia kifejezés: {n}
preview-sql=SQL utasítás előnézete
structure-and-data-settings-unknown=Struktúra és adat beállítások nincsenek kijelölve
table-suffix-error=Érvénytelen szétválasztási egész szám, adjon meg helyes értéket
target-table-name-no-n=A cél táblának tartalmaznia kell a "{n}" karakterláncot.
sharding-strategy-express-empty=A szétválasztási stratégia kifejezés nem lehet üres
copy-table-success-text=A tábla sikeresen másolva.
start=Indítás
complete=Kész
express-title=Tábla szétválasztási stratégia kifejezés
functions=Függvények
express-editor-help=Kifejezés - kattintson duplán egy függvényre vagy mezőre a szerkesztőbe való beszúráshoz
import-from-csv-text-description=Adatok CSV fájlból történő importálásának konfigurációja
source-csv-file=Forrás CSV fájl elérési útja
target-database=Cél adatbázis
target-table=Cél tábla
columns-setttings=Oszlopok
csv-data=CSV adatok
column-name-on-top=Első sor mint oszlopnevek
line-terminated-by=Sorelválasztó
csv-null-as-keyword=null/NULL mint SQL kulcsszó
encoding=Karakterkészlet
import-success-text=Importálás sikeres
incorrect-sql-statement=Helytelen SQL utasítás
import-error-text=Importálási hiba
table-manage-columns=Oszlopok kezelése
table-drop-column=Oszlop törlése
table-manage-indexes=Indexek kezelése
table-drop-index=Index törlése
create-view=Új nézet létrehozása
open-view=Nézet megnyitása
drop-view=Nézet törlése
create-trigger=Eseménykezelő létrehozása
open-trigger=Eseménykezelő megnyitása
drop-trigger=Eseménykezelő törlése
drop-view-confirm-text=A nézet törlése után nem állítható vissza. Megerősíti a törlést?
drop-view-success-text=A nézet sikeresen törölve
drop-trigger-confirm-text=Az eseménykezelő törlése után nem állítható vissza. Megerősíti a törlést?
drop-trigger-success-text=Az eseménykezelő sikeresen törölve
sql-templates=SQL utasítás sablonok
pragma-templates=Pragmas
sql-log=SQL előzmények
clear-all=Minden törlése
use=Használat
explain=Explain
top=Rögzítés
untop=Rögzítés feloldása
copy=Másolás
delete=Törlés
today=Ma
yestoday=Tegnap
delete-sql-log-confirm-text=Biztosan törölni szeretné az SQL naplót?
copy-to-clipboard=Vágólapra másolva
save-success-text=Sikeresen mentve
delete-success-text=Sikeresen törölve
data-has-changed=Az adatok megváltoztak. Biztosan be szeretné zárni az oldalt?
not-save-and-close=Ne mentse, bezárás
cancel=Bezárás megszakítása
table-export-as=Adattábla exportálása	Alt+E
export-as-sql-success-text=Exportálás sikeres. Megnyitja a fájlt?
new-query=Új lekérdezés ablak (F7)
save-current=Aktuális mentése (Ctrl+S)
save-all=Minden mentése (Ctrl+Shift+S)
first-page=Első oldal
prev-page=Előző oldal
next-page=Következő oldal
last-page=Utolsó oldal
save-if-data-has-changed=Az adatok megváltoztak. Mentés előtte?
unsort=Rendezés visszavonása
tab-close-this=Ezen lap bezárása
tab-close-others=Más lapok bezárása
tab-close-left=Balra lévők bezárása
tab-close-right=Jobbra lévők bezárása
perf-analysis=Teljesítményelemzés
perf-analysis-reports=Elemzési jelentések
store-analysis=Tárolás elemzés
db-params=Adatbázis paraméterek
not-select-sql=Csak SELECT utasítások támogatottak
open-sql-log=SQL előzmények megnyitása teljesítményelemzéshez (Ctrl+L)
add-sql-analysis=Adjon meg SQL utasítást teljesítményelemzéshez (Ctrl+I)
sql-log-not-found=Az SQL előzmények nem találhatók, ellenőrizze, hogy nem lettek-e törölve
original-sql=Eredeti SQL utasítás
where-clause-analysis=WHERE záradék elemzése
order-clause-analysis=ORDER záradék elemzése
covering-index-analysis=Lefedő index elemzés
table-join-analysis=JOIN elemzés
in-table=Adattábla
where-use-column=A WHERE utasítás oszlopokat használ
order-use-column=Az ORDER utasítás oszlopokat használ
covering-index-column=A WHERE és ORDER utasítás oszlopokat használ
where-use-index=A WHERE utasítás indexet használ
order-use-index=Az ORDER utasítás indexet használ
use-covering-index=Lefedő indexet használ
create-index-for-performance=Javaslat: hozzon létre indexet a következő oszlopokhoz a lekérdezési teljesítmény javításához
hint-index-for-performance=Tanács: A(z) {hintIndexName} index már lefedi a következő oszlopokat: {hintIndexColumns}
create-covering-index-for-performance=Javaslat: hozzon létre lefedő indexet a következő oszlopokhoz a lekérdezési teljesítmény javításához
create-index-togeger=Index létrehozása (együtt)
create-index-individ=Indexek létrehozása (külön)
create-covering-index=Lefedő index létrehozása
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=Az alábbi pszeudokód a lekérdezés-optimalizáló végrehajtási folyamatát mutatja
cycle-count=Ciklus statisztikák
optimize-cycle-count=Tanács: a JOIN táblák sorrendjének megváltoztatása optimalizálhatja és csökkentheti a ciklusok számát.
general-settings=Általános beállítások
about=Névjegy
language-setting=Kezelőfelület nyelvének beállítása
change-language-restart-text=A nyelv megváltoztatásához újra kell indítani a szoftvert.
close-and-restart=Bezárás és újraindítás
do-not-restart=Ne indítsa újra
about-us=Rólunk
about-us-description=A CuteSqlite egy nyílt forráskódú szoftver, amelyet Xuehan Qin fejlesztett.
version-info=Verzió
version-info-description=CuteSqlite v0.2.2 béta (64 bites)
feedback=Visszajelzés
feedback-description=Ha problémái vannak a szoftverrel, vagy ötletei és javaslatai vannak az alkalmazással kapcsolatban, kérjük, töltse ki az alábbi űrlapot, hogy visszajelzést küldjön nekünk.
content-text=Tartalom
license=Apache Licenc 2.0 verzió
select-columns-analysis=SELECT oszlopok elemzése
select-use-column=A SELECT utasítás a következő oszlopokat használja
select-use-column-count=Oszlopok száma
select-use-column-advice=Javaslat: a SELECT utasítás több mint {maxColumns} oszlopot választ ki. Az oszlopok számának csökkentése javíthatja a lekérdezési teljesítményt.
select-use-column-tips=Tanács: az oszlopok számának csökkentése javíthatja a lekérdezési teljesítményt.
sql-perf-report-prefix=sql-teljesítmény-jelentés-
store-analysis-prefix=Tárolás elemzés:
analysis-sql=SQL elemzés
open-perf-report=Jelentés megnyitása		Alt+O
drop-perf-report=Jelentés törlése		Alt+Del
drop-perf-report-confirm-text=Megerősíti a jelentés törlését?
store-analysis-text=Lehetővé teszi az adatbázis, adattáblák, táblaindexek tárolókapacitásának elemzését
table-store-analysis=Tábla - {tblName}
index-store-analysis=Index - {idxName} - Tábla: {tblName}
db-disk-used-title=Lemezterület-használati jelentés, adatbázis elérési út: {dbPath}
page-size-text=Lap mátret (byte)
page-size-tips=Lap méret (byte)
file-bytes-text=Fájl méret (byte)
file-bytes-tips=Fájl méret (byte)
file-pgcnt-text=Oldalak száma a teljes fájlban (mért)
file-pgcnt-tips=Oldalak száma a teljes fájlban (mért)
file-pgcnt2-text=Oldalak száma a teljes fájlban (számított)
file-pgcnt2-tips=Oldalak száma a teljes fájlban (számított)
inuse-pgcnt-text=Adatokat tároló oldalak száma (használt)
inuse-pgcnt-tips=Adatokat tároló oldalak száma (használt)
free-pgcnt2-text=Adat nélküli oldalak száma (fejlécenként)
free-pgcnt2-tips=Adat nélküli oldalak száma (fejlécenként)
free-pgcnt-text=Adat nélküli oldalak száma (számított)
free-pgcnt-tips=Adat nélküli oldalak száma (számított)
av-pgcnt-text=Automatikusan kiürített oldalak száma
av-pgcnt-tips=Automatikusan kiürített oldalak száma
ntable-text=Táblák száma az adatbázisban
ntable-tips=Táblák száma az adatbázisban
nindex-text=Indexek száma
nindex-tips=Indexek száma
nmanindex-text=Definiált indexek száma
nmanindex-tips=Definiált indexek száma
nautoindex-text=Implicit indexek száma (auto-növekményes indexek)
nautoindex-tips=Implicit indexek száma (auto-növekményes indexek)
user-payload-text=A felhasználói hasznos teher tárolt bájtjai
user-payload-tips=A felhasználói hasznos teher tárolt bájtjai
all-tbl-entrycnt-title=Minden tábla összes adata (rekordok száma)
all-tbl-idx-pagecnt-title=Minden tábla és indexeik oldalszáma
sperate-tbl-idx-pagecnt-title=Minden tábla és index oldalai külön számítva
all-tbl-idx-report-title=Minden tábla és index
total-pages-percent-text=Százalékos arány a teljes adatbázisból
total-pages-percent-tips=Százalékos arány a teljes adatbázisból
nentry-text=Adatmennyiség (rekordok száma)
nentry-tips=Adatmennyiség (rekordok száma)
storage-text=Felhasznált tárolási bájtok
storage-tips=Felhasznált tárolási bájtok
compressed-size-text=Tömörítés után felhasznált bájtok
compressed-size-tips=Tömörítés után felhasznált bájtok
payload-text=Hasznos teher bájtjai
payload-tips=Hasznos teher bájtjai
total-meta-text=Metaadatok bájtjai
total-meta-tips=Metaadatok bájtjai
depth-text=B-fa mélysége
depth-tips=B-fa mélysége
avg-payload-text=Átlagos hasznos teher rekordonként
avg-payload-tips=Átlagos hasznos teher rekordonként
avg-unused-text=Átlagosan fel nem használt bájtok rekordonként
avg-unused-tips=Átlagosan fel nem használt bájtok rekordonként
avg-meta-text=Átlagos metaadatok rekordonként
avg-meta-tips=Átlagos metaadatok rekordonként
avg-fanout-text=Átlagos elágazási tényező
avg-fanout-tips=Átlagos elágazási tényező
gap-cnt-text=Nem folytonos oldalak
gap-cnt-tips=Nem folytonos oldalak
mx-payload-text=Maximális hasznos teher rekordonként
mx-payload-tips=Maximális hasznos teher rekordonként
ovfl-cnt-text=Felhasznált túlcsordulási adatok száma
ovfl-cnt-tips=Felhasznált túlcsordulási adatok száma
int-pages-text=Felhasznált indexoldalak száma
int-pages-tips=Felhasznált indexoldalak száma
leaf-pages-text=Felhasznált levéloldalak száma
leaf-pages-tips=Felhasznált levéloldalak száma
ovfl-pages-text=Felhasznált túlcsordulási oldalak száma
ovfl-pages-tips=Felhasznált túlcsordulási oldalak száma
total-pages-text=Felhasznált oldalak teljes száma
total-pages-tips=Felhasznált oldalak teljes száma
int-unused-text=Fel nem használt bájtok az indexoldalakon
int-unused-tips=Fel nem használt bájtok az indexoldalakon
leaf-unused-text=Fel nem használt bájtok a levéloldalakon
leaf-unused-tips=Fel nem használt bájtok a levéloldalakon
ovfl-unused-text=Fel nem használt bájtok a túlcsordulási oldalakon
ovfl-unused-tips=Fel nem használt bájtok a túlcsordulási oldalakon
total-unused-text=Fel nem használt bájtok az összes oldalon
total-unused-tips=Fel nem használt bájtok az összes oldalon
all-table-report-title=Minden tábla (indexek nélkül)
all-indices-report-title=Minden index (táblák nélkül)
tbl-and-all-idx-report-title={tblName} tábla és összes indexe
tbl-only-report-title={tblName} tábla (bármely index nélkül)
idx-only-report-title=A(z) {tblName} tábla összes indexe
tbl-report-title={tblName} tábla
idx-report-title=A(z) {tblName} tábla {idxName} indexe
props-tbl-only-report-title=A(z) {tblName} tábla tárolási elemzése
props-idx-props-only-report-title=A(z) {tblName} tábla összes indexe
db-pragma-params=PRAGMA paraméterek
db-quick-config-params=Gyors konfigurációs beállítások
select-pragma=PRAGMA
pragma-analysis-limit-tips=Az elemzési (ANALYZE) beállítások korlátjának lekérdezése vagy módosítása. Ez az elemzési parancs által az egyes indexekben megvizsgált sorok hozzávetőleges száma.
pragma-application-id-tips=A 32 bites előjeles big-endian "Application ID" egész szám lekérdezésére vagy beállítására szolgál az adatbázis fejlécének 68. eltolásánál.
pragma-auto-vacuum-tips=Az automatikus kiürítés (auto-vacuum) állapotának lekérdezése vagy beállítása az adatbázisban.
pragma-automatic-index-tips=Az automatikus index funkció lekérdezése, be- vagy kikapcsolása.
pragma-busy-timeout-tips=A foglaltsági időtúllépés (busy timeout) beállításának lekérdezése vagy módosítása.
pragma-cache-size-tips=Azon adatbázis lemezoldalak maximális számának lekérdezése vagy módosítása, amelyet az SQLite javasol memóriában tartani minden megnyitott adatbázisfájlhoz.
pragma-cache-spill-tips=A lapozóprogram azon képességének be- vagy kikapcsolása, hogy piszkos gyorsítótár-oldalakat írjon ki az adatbázisfájlba egy tranzakció közepén.
pragma-case-sensitive-like-tips=A LIKE operátor alapértelmezett viselkedése figyelmen kívül hagyja a kis- és nagybetűket az ASCII karakterek esetében. Ezért alapértelmezés szerint az 'a' LIKE 'A' igaz.
pragma-cell-size-check-tips=További szanitéc ellenőrzések be- vagy kikapcsolása az adatbázis B-fa oldalainak lemezről történő olvasásakor. Ha a cellaméret-ellenőrzés be van kapcsolva, az adatbázis sérülése korábban észlelhető, és kisebb valószínűséggel "terjed szét".
pragma-checkpoint-fullfsync-tips=A fullfsync jelző lekérdezése vagy módosítása az ellenőrzőpont-műveletekhez. Ha ez a jelző be van állítva, az F_FULLFSYNC szinkronizációs módszer kerül használatra az ellenőrzőpont-műveletek során az F_FULLFSYNC-t támogató rendszereken. A CHECKPOINT_FULLFSYNC jelző alapértelmezett értéKE OFF. Csak a Mac OS-X támogatja az F_FULLFSYNC-et.
pragma-collation-list-tips=Visszaadja az aktuális adatbázis-kapcsolathoz definiált rendezési sorozatok listáját.
pragma-compile-options-tips=Visszaadja az SQLite fordítása során használt fordítási időbeli opciók nevét, egy opciót soronként.
pragma-count-changes-tips=A változások számlálása (count changes) jelző lekérdezése vagy módosítása. Normális esetben, ha a változásszámláló jelző nincs beállítva, az INSERT, UPDATE és DELETE utasítások nem adnak vissza adatokat.
pragma-data-store-directory-tips=Az sqlite3_data_directory globális változó értékének lekérdezése vagy módosítása, amelyet a Windows operációs rendszer interfész háttérrendszere használ a relatív elérési úttal megadott adatbázisfájlok tárolási helyének meghatározásához.
pragma-data-version-tips=Jelzi, hogy az adatbázisfájl módosult. Az interaktív programok, amelyek az adatbázis tartalmát memóriában tárolják vagy a képernyőn jelenítik meg, használhatják a PRAGMA data_version parancsot annak meghatározására, hogy frissíteniük és újra kell-e tölteniük a memóriát vagy frissíteniük kell-e a képernyőmegjelenítést.
pragma-default-cache-size-tips=A javasolt maximális lemez-gyorsítótár oldalak számának lekérdezése vagy beállítása, amelyek minden megnyitott adatbázisfájlhoz lefoglalásra kerülnek.
pragma-defer-foreign-keys-tips=Elrendeli, hogy az összes külső kulcs megkötés elhalasztásra kerüljön a legkülső tranzakció véglegesítéséig.
pragma-empty-result-callbacks-tips=Az üres eredmény visszahívási (callback) jelző lekérdezése vagy módosítása.
pragma-encoding-tips=A fő adatbázis által használt szövegkódolás: 'UTF-8', 'UTF-16le' (kis endian UTF-16) vagy 'UTF-16be' (nagy endian UTF-16).
pragma-foreign-key-check-tips=Ellenőrzi az adatbázist vagy táblát a külső kulcs megkötések megsértésére.
pragma-foreign-keys-tips=A külső kulcs megkötések kikényszerítésének lekérdezése, be- vagy kikapcsolása.
pragma-freelist-count-tips=Visszaadja a nem használt oldalak számát az adatbázisfájlban.
pragma-full-column-names-tips=A teljes oszlopnevek (full_column_names) jelző lekérdezése vagy módosítása.
pragma-fullfsync-tips=A fullfsync jelző lekérdezése vagy módosítása. Ez a jelző határozza meg, hogy az F_FULLFSYNC szinkronizációs módszer használatra kerüljön-e az azt támogató rendszereken. A fullfsync alapértelmezett értéke OFF. Csak a Mac OS X támogatja az F_FULLFSYNC-et.
pragma-hard-heap-limit-tips=Korlátot állít be a kupacmemória (heap) mennyiségére egyetlen folyamat összes adatbázis-kapcsolata számára.
pragma-ignore-check-constraints-tips=A CHECK megkötések kikényszerítésének be- vagy kikapcsolása. Az alapértelmezett beállítás OFF, ami azt jelenti, hogy a CHECK megkötések alapértelmezés szerint kikényszerítésre kerülnek.
pragma-incremental-vacuum-tips=Legfeljebb N oldal eltávolítását okozza a szabadlistáról (freelist).
pragma-integrity-check-tips=Alacsony szintű formázási és konzisztencia-ellenőrzést végez az adatbázison.
pragma-journal-mode-tips=Az aktuális kapcsolathoz tartozó adatbázis naplózási módjának (journal mode) lekérdezése vagy beállítása.
pragma-journal-size-limit-tips=Korlátozza a tranzakció vagy ellenőrzőpont után a fájlrendszerben megmaradó visszagörgetési naplók (rollback journal) és WAL fájlok méretét.
pragma-legacy-alter-table-tips=Beállítja vagy lekérdezi a legacy_alter_table jelző értékét.
pragma-locking-mode-tips=Beállítja vagy lekérdezi az adatbázis-kapcsolat zárolási módját (locking mode). A módok: NORMAL vagy EXCLUSIVE.
pragma-max-page-count-tips=Az adatbázisfájlban lévő oldalak maximális számának lekérdezése vagy beállítása.
pragma-mmap-size-tips=Egyetlen adatbázison a memóriába leképezett I/O (memory-mapped I/O) számára fenntartott bájtok maximális számának lekérdezése vagy módosítása.
pragma-module-list-tips=Visszaadja az adatbázis-kapcsolatnál regisztrált virtuális tábla modulok listáját.
pragma-optimize-tips=Megkísérli optimalizálni az adatbázist.
pragma-page-count-tips=Visszaadja az adatbázisfájlban lévő oldalak teljes számát.
pragma-page-size-tips=Az adatbázis oldalméretének lekérdezése vagy beállítása. Az oldalméretnek kettő hatványának kell lennie 512 és 65536 között.
pragma-parser-trace-tips=Bekapcsolja az SQLite által belsőleg használt SQL elemző nyomkövetését (trace). Csak akkor hat, ha SQLITE_DEBUG-gel lett fordítva.
pragma-query-only-tips=Megakadályozza az adatmódosításokat az adatbázisfájlban. Ha be van kapcsolva, bármely CREATE, UPDATE, DROP, INSERT vagy UPDATE kísérlet SQLITE_READONLY hibát eredményez.
pragma-quick-check-tips=Alacsony szintű formázási és konzisztencia-ellenőrzést végez az adatbázison, kihagyva az UNIQUE és index konzisztencia-ellenőrzéseket.
pragma-read-uncommitted-tips=A READ UNCOMMITTED elkülönítési szint lekérdezése, be- vagy kikapcsolása.
pragma-recursive-triggers-tips=Az eseménykezelők rekurzív végrehajtásának lekérdezése, be- vagy kikapcsolása.
pragma-reverse-unordered-selects-tips=Ha be van kapcsolva, ez a PRAGMA azt okozza, hogy sok ORDER BY záradék nélküli SELECT utasítás az eredményeket általában fordított sorrendben adja vissza.
pragma-schema-version-tips=Lekéri vagy beállítja a séma verzió (schema_version) egész számot az adatbázis fejlécének 40. eltolásánál.
pragma-secure-delete-tips=A biztonságos törlés (secure-delete) beállításának lekérdezése vagy módosítása.
pragma-short-column-names-tips=A rövid oszlopnevek (short column names) jelző lekérdezése vagy módosítása.
pragma-soft-heap-limit-tips=Korlátozza az egyetlen folyamatban lévő összes adatbázis-kapcsolat által használt kupacmemória mennyiségét.
pragma-stats-tips=Kisegítő információkat ad vissza a táblákról és indexekről.
pragma-synchronous-tips=A "szinkron" (synchronous) jelző beállításának lekérdezése vagy módosítása.
pragma-temp-store-tips=Az sqlite3_temp_directory globális változó értékének lekérdezése vagy módosítása, amelyet számos operációs rendszer interfész háttérrendszer használ az ideiglenes táblák és indexek tárolási helyének meghatározásához.
pragma-threads-tips=Egy előkészített utasítás (prepared statement) által a lekérdezés segítésére indított segédszálak száma.
pragma-trusted-schema-tips=Engedélyezi-e a nem biztonsági ellenőrzésen átesett SQL függvények és virtuális táblák futtatását a sémában. Meghatározza, hogy a nézetek, eseménykezelők vagy sémakifejezések (mint a CHECK megkötések, DEFAULT záradékok, generált oszlopok, kifejezésindexek és/vagy részleges indexek) futtathatnak-e nem biztonsági ellenőrzésen átesett SQL függvényeket és virtuális táblákat.
pragma-user-version-tips=Lekéri vagy beállítja a felhasználói verzió (user_version) egész számot az adatbázis fejlécének 60. eltolásánál.
pragma-vdbe-addoptrace-tips=A teljes VDBE műveleti kódok megjelennek a kódgenerálás során. Feltéve, hogy az SQLite az SQLITE_DEBUG opcióval lett fordítva, és a vdbe_debug be van kapcsolva.
pragma-vdbe-debug-tips=Bekapcsolja a VDBE hibakeresést. Feltéve, hogy az SQLite az SQLITE_DEBUG opcióval lett fordítva.
pragma-vdbe-listing-tips=Megjeleníti a virtuális gép műveleti kódjainak teljes listáját a szabványos kimeneten. Feltéve, hogy az SQLite az SQLITE_DEBUG opcióval lett fordítva, és a vdbe_debug be van kapcsolva.
pragma-vdbe-trace-tips=Kiírja a virtuális gép műveleti kódjait a szabványos kimeneten a számítás során. Feltéve, hogy az SQLite az SQLITE_DEBUG opcióval lett fordítva, és a vdbe_debug be van kapcsolva.
pragma-wal-autocheckpoint-tips=Az írás-előnapló (write-ahead log) automatikus ellenőrzőpont-intervallumának lekérdezése vagy beállítása.
pragma-wal-checkpoint-tips=A D kapcsolatban lévő X adatbázis írás-előnaplójának (write-ahead log) tartalmát átviszi az adatbázisfájlba, és visszaállítja az írás-előnaplót.
pragma-writable-schema-tips=Lehetővé teszi az sqlite_schema tábla módosítását hagyományos UPDATE, INSERT és DELETE utasításokkal. Figyelmeztetés: a pragma visszaélése könnyen az adatbázisfájl sérüléséhez vezethet.
pragma-save-confirm=A PRAGMA utasítás hatással lesz az adatbázis működésére. Megerősíti a következő utasítás végrehajtását?
confirm-exec-text=Megerősítés és végrehajtás